Revit 2027 API
FabricationPart.ProductShortDescription Property
 The product short description of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ProductShortDescription { get; }
Public ReadOnly Property ProductShortDescription As String
	Get
public:
property String^ ProductShortDescription {
	String^ get ();
}
member ProductShortDescription : string with get
Property Value
String
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace